controllers/CompanyController.php

SELECT * FROM `company`
---
    public function actionIndex()
    {
        $model = Company::find()->All();

SELECT * FROM `company` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Company::findOne($id)) !== null) {